package com.godelsoft.canteen;

/**
 * Класс, предоставляющий данные о столовых
 */
public class CanteenLoader {
    private static String[] hard = new String[] {
            "Столовая ГЗ__END_LINE__\n__END_LINE__\n10:0:18:0__END_LINE__\n-__END_LINE__\n__END_LINE__\n15:0:15:30__END_LINE__\n-__END_LINE__\nSTART_DISHES__END_LINE__\n0:0:Холодец:114:18.22:16.67:2.54:236:-:5000:\"\"__END_LINE__\n1:1:Борщ:245:3.36:4.02:8.26:78:-:9000:\"Традиционный\"__END_LINE__\n2:1:Суп грибной:250:2.32:8.98:9.3:129:+:6500:\"Из лисичек\"__END_LINE__\n3:2:Котлета домашняя:95:14.52:13.34:12.71:233:-:7500:\"\"__END_LINE__\n4:2:Куриные голени запеченые:60:13.94:5.75:0:111:-:5500:\"\"__END_LINE__\n5:3:Рис вареный:120:3.29:0.42:29.49:139:+:4000:\"\"__END_LINE__\n6:3:Гречка отварная:115:3.7:4.8:21.91:138:+:6000:\"\"__END_LINE__\n7:3:Картофель запеченный:120:3.13:2.99:17.61:108:+:4000:\"Запечен на костре\"__END_LINE__\n8:3:Красная фасоль:115:0.34:5.25:15.59:85:+:3000:\"\"__END_LINE__\n9:4:Хлеб черный:26:1.72:0.31:11.29:52:+:1000:\"\"__END_LINE__\n10:6:Чай черный:120:0:0:0.71:2:+:2000:\"Углеводы\"__END_LINE__\nEND_DISHES__END_LINE__\n0:1:3:5:7:9:10__END_LINE__\n0:2:4:6:8:9:10__END_LINE__\n0:1:3:5:7:9:10__END_LINE__\n0:2:4:6:8:9:10__END_LINE__\n0:1:3:5:7:9:10__END_LINE__\n-__END_LINE__\n",
            "Столовая УЛК__END_LINE__\n__END_LINE__\n8:30:19:0__END_LINE__\n8:30:19:0__END_LINE__\n__END_LINE__\n-__END_LINE__\n-__END_LINE__\nSTART_DISHES__END_LINE__\n0:0:Сельдь под шубой:100:5.03:15.75:7.21:189:-:6000:\"\"__END_LINE__\n1:0:Винигрет:80:0.77:8.36:5.35:98:-:5000:\"Салат такой\"__END_LINE__\n2:1:Куриный суп лапша:241:3.18:2.39:7.4:65:-:8000:\"\"__END_LINE__\n3:1:Бульон с яйцом:190:5.64:2.87:0.82:55:-:6500:\"\"__END_LINE__\n4:1:Суп рыбный (горбуша):250:8.83:2.72:6.39:86:-:6000:\"\"__END_LINE__\n5:1:Борщ:245:3.36:4.02:8.26:78:-:9000:\"Традиционный\"__END_LINE__\n6:2:Котлета домашняя:95:14.52:13.34:12.71:233:-:7500:\"\"__END_LINE__\n7:2:Сосиски молочные (2 штуки):120:13.19:33.57:0.86:360:-:6000:\"\"__END_LINE__\n8:2:Рыба жареная (сайда):120:17.44:0.85:0:82:-:10000:\"Свежая\"__END_LINE__\n9:2:Куриные голени запеченые:60:13.94:5.75:0:111:-:5500:\"\"__END_LINE__\n10:2:Свинина тушеная:115:18.77:20.08:2.84:270:-:10000:\"\"__END_LINE__\n11:3:Рис вареный:120:3.29:0.42:29.49:139:+:4000:\"\"__END_LINE__\n12:3:Гречка отварная:115:3.7:4.8:21.91:138:+:6000:\"\"__END_LINE__\n13:3:Картофель запеченный:120:3.13:2.99:17.61:108:+:4000:\"Запечен на костре\"__END_LINE__\n14:3:Пшеничная крупа булгур:100:12.29:1.33:75.87:342:+:4000:\"\"__END_LINE__\n15:3:Красная фасоль:115:0.34:5.25:15.59:85:+:3000:\"\"__END_LINE__\n16:4:Хлеб черный:26:1.72:0.31:11.29:52:+:1000:\"\"__END_LINE__\n17:4:Хлеб белый:25:1.91:0.82:12.65:66:+:1000:\"\"__END_LINE__\n18:6:Морс:120:1.29:0.62:11.35:50:+:3000:\"Клюквенный\"__END_LINE__\n19:6:Чай черный:120:0:0:0.71:2:+:2000:\"\"__END_LINE__\n20:6:Чай зеленый:120:0:0:0.71:2:+:2000:\"\"__END_LINE__\nEND_DISHES__END_LINE__\n0:1:2:3:4:5:6:7:8:9:10:11:12:13:14:15:16:17:18:19:20__END_LINE__\n0:1:2:3:4:5:6:7:8:9:10:11:12:13:14:15:16:17:18:19:20__END_LINE__\n0:1:2:3:4:5:6:7:8:9:10:11:12:13:14:15:16:17:18:19:20__END_LINE__\n0:1:2:3:4:5:6:7:8:9:10:11:12:13:14:15:16:17:18:19:20__END_LINE__\n0:1:2:3:4:5:6:7:8:9:10:11:12:13:14:15:16:17:18:19:20__END_LINE__\n0:1:2:3:4:5:6:7:8:9:10:11:12:13:14:15:16:17:18:19:20__END_LINE__\n0:1:2:3:4:5:6:7:8:9:10:11:12:13:14:15:16:17:18:19:20__END_LINE__\n",
    };

    public CanteenLoader() {
    }

    /**
     * Получение списка всех столовых
     * @return Массив CanteenProvider
     */
    public CanteenProvider[] getCanteens() {
        CanteenProvider[] t = new CanteenProvider[hard.length];
        for (int i = 0; i < t.length; i++)
            t[i] = new CanteenProvider(hard[i]);
        return t;
    }
}
